Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ16MC101.h
#define _OVDCON_POUT2L_POSITION                  0x00000002
#define _OVDCON_POUT2L_MASK                      0x00000004
#define _OVDCON_POUT2L_LENGTH                    0x00000001

#define _OVDCON_POUT2H_POSITION                  0x00000003
#define _OVDCON_POUT2H_MASK                      0x00000008
#define _OVDCON_POUT2H_LENGTH                    0x00000001

#define _OVDCON_POUT3L_POSITION                  0x00000004
#define _OVDCON_POUT3L_MASK                      0x00000010
#define _OVDCON_POUT3L_LENGTH                    0x00000001

#define _OVDCON_POUT3H_POSITION                  0x00000005
#define _OVDCON_POUT3H_MASK                      0x00000020
#define _OVDCON_POUT3H_LENGTH                    0x00000001

#define _OVDCON_POVD1L_POSITION                  0x00000008
#define _OVDCON_POVD1L_MASK                      0x00000100
#define _OVDCON_POVD1L_LENGTH                    0x00000001

#define _OVDCON_POVD1H_POSITION                  0x00000009
#define _OVDCON_POVD1H_MASK                      0x00000200
#define _OVDCON_POVD1H_LENGTH                    0x00000001

#define _OVDCON_POVD2L_POSITION                  0x0000000A
#define _OVDCON_POVD2L_MASK                      0x00000400
#define _OVDCON_POVD2L_LENGTH                    0x00000001

#define _OVDCON_POVD2H_POSITION                  0x0000000B
#define _OVDCON_POVD2H_MASK                      0x00000800
#define _OVDCON_POVD2H_LENGTH                    0x00000001

#define _OVDCON_POVD3L_POSITION                  0x0000000C
#define _OVDCON_POVD3L_MASK                      0x00001000
#define _OVDCON_POVD3L_LENGTH                    0x00000001

#define _OVDCON_POVD3H_POSITION                  0x0000000D
#define _OVDCON_POVD3H_MASK                      0x00002000
#define _OVDCON_POVD3H_LENGTH                    0x00000001

#define _P1OVDCON_POUT1L_POSITION                0x00000000
#define _P1OVDCON_POUT1L_MASK                    0x00000001
#define _P1OVDCON_POUT1L_LENGTH                  0x00000001

#define _P1OVDCON_POUT1H_POSITION                0x00000001
#define _P1OVDCON_POUT1H_MASK                    0x00000002
#define _P1OVDCON_POUT1H_LENGTH                  0x00000001

#define _P1OVDCON_POUT2L_POSITION                0x00000002
#define _P1OVDCON_POUT2L_MASK                    0x00000004
#define _P1OVDCON_POUT2L_LENGTH                  0x00000001

#define _P1OVDCON_POUT2H_POSITION                0x00000003
#define _P1OVDCON_POUT2H_MASK                    0x00000008
#define _P1OVDCON_POUT2H_LENGTH                  0x00000001

#define _P1OVDCON_POUT3L_POSITION                0x00000004
#define _P1OVDCON_POUT3L_MASK                    0x00000010
#define _P1OVDCON_POUT3L_LENGTH                  0x00000001

#define _P1OVDCON_POUT3H_POSITION                0x00000005
#define _P1OVDCON_POUT3H_MASK                    0x00000020
#define _P1OVDCON_POUT3H_LENGTH                  0x00000001

#define _P1OVDCON_POVD1L_POSITION                0x00000008
#define _P1OVDCON_POVD1L_MASK                    0x00000100
#define _P1OVDCON_POVD1L_LENGTH                  0x00000001

#define _P1OVDCON_POVD1H_POSITION                0x00000009
#define _P1OVDCON_POVD1H_MASK                    0x00000200
#define _P1OVDCON_POVD1H_LENGTH                  0x00000001

#define _P1OVDCON_POVD2L_POSITION                0x0000000A
#define _P1OVDCON_POVD2L_MASK                    0x00000400
#define _P1OVDCON_POVD2L_LENGTH                  0x00000001

#define _P1OVDCON_POVD2H_POSITION                0x0000000B
#define _P1OVDCON_POVD2H_MASK                    0x00000800
#define _P1OVDCON_POVD2H_LENGTH                  0x00000001

#define _P1OVDCON_POVD3L_POSITION                0x0000000C
#define _P1OVDCON_POVD3L_MASK                    0x00001000
#define _P1OVDCON_POVD3L_LENGTH                  0x00000001

#define _P1OVDCON_POVD3H_POSITION                0x0000000D
#define _P1OVDCON_POVD3H_MASK                    0x00002000
#define _P1OVDCON_POVD3H_LENGTH                  0x00000001

#define _I2C1CON_SEN_POSITION                    0x00000000
#define _I2C1CON_SEN_MASK                        0x00000001
#define _I2C1CON_SEN_LENGTH                      0x00000001

#define _I2C1CON_RSEN_POSITION                   0x00000001
#define _I2C1CON_RSEN_MASK                       0x00000002
#define _I2C1CON_RSEN_LENGTH                     0x00000001

#define _I2C1CON_PEN_POSITION                    0x00000002
#define _I2C1CON_PEN_MASK                        0x00000004
#define _I2C1CON_PEN_LENGTH                      0x00000001

#define _I2C1CON_RCEN_POSITION                   0x00000003
#define _I2C1CON_RCEN_MASK                       0x00000008
#define _I2C1CON_RCEN_LENGTH                     0x00000001

#define _I2C1CON_ACKEN_POSITION                  0x00000004
#define _I2C1CON_ACKEN_MASK                      0x00000010
#define _I2C1CON_ACKEN_LENGTH                    0x00000001

#define _I2C1CON_ACKDT_POSITION                  0x00000005
#define _I2C1CON_ACKDT_MASK                      0x00000020
#define _I2C1CON_ACKDT_LENGTH                    0x00000001

#define _I2C1CON_STREN_POSITION                  0x00000006
#define _I2C1CON_STREN_MASK                      0x00000040
#define _I2C1CON_STREN_LENGTH                    0x00000001

#define _I2C1CON_GCEN_POSITION                   0x00000007
#define _I2C1CON_GCEN_MASK                       0x00000080
#define _I2C1CON_GCEN_LENGTH                     0x00000001

#define _I2C1CON_SMEN_POSITION                   0x00000008
#define _I2C1CON_SMEN_MASK                       0x00000100
#define _I2C1CON_SMEN_LENGTH                     0x00000001

#define _I2C1CON_DISSLW_POSITION                 0x00000009
#define _I2C1CON_DISSLW_MASK                     0x00000200
#define _I2C1CON_DISSLW_LENGTH                   0x00000001

#define _I2C1CON_A10M_POSITION                   0x0000000A
#define _I2C1CON_A10M_MASK                       0x00000400
#define _I2C1CON_A10M_LENGTH                     0x00000001

#define _I2C1CON_IPMIEN_POSITION                 0x0000000B
#define _I2C1CON_IPMIEN_MASK                     0x00000800
#define _I2C1CON_IPMIEN_LENGTH                   0x00000001

#define _I2C1CON_SCLREL_POSITION                 0x0000000C
#define _I2C1CON_SCLREL_MASK                     0x00001000
#define _I2C1CON_SCLREL_LENGTH                   0x00000001

#define _I2C1CON_I2CSIDL_POSITION                0x0000000D
#define _I2C1CON_I2CSIDL_MASK                    0x00002000
#define _I2C1CON_I2CSIDL_LENGTH                  0x00000001

#define _I2C1CON_I2CEN_POSITION                  0x0000000F
#define _I2C1CON_I2CEN_MASK                      0x00008000
#define _I2C1CON_I2CEN_LENGTH                    0x00000001

#define _I2C1STAT_TBF_POSITION                   0x00000000
#define _I2C1STAT_TBF_MASK                       0x00000001
#define _I2C1STAT_TBF_LENGTH                     0x00000001

#define _I2C1STAT_RBF_POSITION                   0x00000001
#define _I2C1STAT_RBF_MASK                       0x00000002
#define _I2C1STAT_RBF_LENGTH                     0x00000001

#define _I2C1STAT_R_W_POSITION                   0x00000002
#define _I2C1STAT_R_W_MASK                       0x00000004
#define _I2C1STAT_R_W_LENGTH                     0x00000001

#define _I2C1STAT_S_POSITION                     0x00000003
#define _I2C1STAT_S_MASK                         0x00000008
#define _I2C1STAT_S_LENGTH                       0x00000001

